knieriem/tinygo-stm32-svd/svd/stm32h755cm4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMAMUX2</name>
      <description>DMAMUX</description>
      <groupName>DMAMUX</groupName>
      <baseAddress>0x58025800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMAMUX2_OVR</name>
        <description>DMAMUX2 overrun interrupt</description>
        <value>128</value>
      </interrupt>
      <registers>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>C%sCR</name>
          <displayName>C%sCR</displayName>
          <description>DMAMux - DMA request line multiplexer
          channel x control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMAREQ_ID</name>
              <description>Input DMA request line
              selected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>DMAREQ_ID</name>
                <enumeratedValue>
                  <name>none</name>
                  <description>No signal selected as request input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux2_req_gen0</name>
                  <description>Signal `dmamux2_req_gen0` selected as request input</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux2_req_gen1</name>
                  <description>Signal `dmamux2_req_gen1` selected as request input</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux2_req_gen2</name>
                  <description>Signal `dmamux2_req_gen2` selected as request input</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux2_req_gen3</name>
                  <description>Signal `dmamux2_req_gen3` selected as request input</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux2_req_gen4</name>
                  <description>Signal `dmamux2_req_gen4` selected as request input</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux2_req_gen5</name>
                  <description>Signal `dmamux2_req_gen5` selected as request input</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux2_req_gen6</name>
                  <description>Signal `dmamux2_req_gen6` selected as request input</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux2_req_gen7</name>
                  <description>Signal `dmamux2_req_gen7` selected as request input</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lpuart1_rx_dma</name>
                  <description>Signal `lpuart1_rx_dma` selected as request input</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lpuart1_tx_dma</name>
                  <description>Signal `lpuart1_tx_dma` selected as request input</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>spi6_rx_dma</name>
                  <description>Signal `spi6_rx_dma` selected as request input</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>spi6_tx_dma</name>
                  <description>Signal `spi6_tx_dma` selected as request input</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i2c4_rx_dma</name>
                  <description>Signal `i2c4_rx_dma` selected as request input</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i2c4_tx_dma</name>
                  <description>Signal `i2c4_tx_dma` selected as request input</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sai4_a_dma</name>
                  <description>Signal `sai4_a_dma` selected as request input</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sai4_b_dma</name>
                  <description>Signal `sai4_b_dma` selected as request input</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>adc3_dma</name>
                  <description>Signal `adc3_dma` selected as request input</description>
                  <value>17</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOIE</name>
              <description>Interrupt enable at synchronization
              event overrun</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SOIE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Synchronization overrun interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Synchronization overrun interrupt enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EGE</name>
              <description>Event generation
              enable/disable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EGE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Event generation disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Event generation enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SE</name>
              <description>Synchronous operating mode
              enable/disable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Synchronization disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Synchronization enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPOL</name>
              <description>Synchronization event type selector
              Defines the synchronization event on the selected
              synchronization input:</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>SPOL</name>
                <enumeratedValue>
                  <name>NoEdge</name>
                  <description>No event, i.e. no synchronization nor detection</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RisingEdge</name>
                  <description>Rising edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FallingEdge</name>
                  <description>Falling edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BothEdges</name>
                  <description>Rising and falling edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NBREQ</name>
              <description>Number of DMA requests to forward
              Defines the number of DMA requests forwarded before
              output event is generated. In synchronous mode, it
              also defines the number of DMA requests to forward
              after a synchronization event, then stop forwarding.
              The actual number of DMA requests forwarded is
              NBREQ+1. Note: This field can only be written when
              both SE and EGE bits are reset.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SYNC_ID</name>
              <description>Synchronization input
              selected</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <name>SYNC_ID</name>
                <enumeratedValue>
                  <name>dmamux2_evt0</name>
                  <description>Signal `dmamux2_evt0` selected as synchronization input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux2_evt1</name>
                  <description>Signal `dmamux2_evt1` selected as synchronization input</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux2_evt2</name>
                  <description>Signal `dmamux2_evt2` selected as synchronization input</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux2_evt3</name>
                  <description>Signal `dmamux2_evt3` selected as synchronization input</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux2_evt4</name>
                  <description>Signal `dmamux2_evt4` selected as synchronization input</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dmamux2_evt5</name>
                  <description>Signal `dmamux2_evt5` selected as synchronization input</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lpuart1_rx_wkup</name>
                  <description>Signal `lpuart1_rx_wkup` selected as synchronization input</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lpuart1_tx_wkup</name>
                  <description>Signal `lpuart1_tx_wkup` selected as synchronization input</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lptim2_out</name>
                  <description>Signal `lptim2_out` selected as synchronization input</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lptim3_out</name>
                  <description>Signal `lptim3_out` selected as synchronization input</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i2c4_wkup</name>
                  <description>Signal `i2c4_wkup` selected as synchronization input</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>spi6_wkup</name>
                  <description>Signal `spi6_wkup` selected as synchronization input</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>comp1_out</name>
                  <description>Signal `comp1_out` selected as synchronization input</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rtc_wkup</name>
                  <description>Signal `rtc_wkup` selected as synchronization input</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>syscfg_exti0_mux</name>
                  <description>Signal `syscfg_exti0_mux` selected as synchronization input</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>syscfg_exti2_mux</name>
                  <description>Signal `syscfg_exti2_mux` selected as synchronization input</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
