knieriem/tinygo-stm32-svd/svd/stm32h755cm4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>Ethernet_MTL</name>
      <description>Ethernet MTL</description>
      <baseAddress>0x40028C00</baseAddress>
      <registers>
        <register>
          <name>MTLOMR</name>
          <description>Operating mode Register</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNTCLR</name>
              <description>Counters Reset</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CNTPRST</name>
              <description>Counters Preset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTXSTS</name>
              <description>Drop Transmit Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLISR</name>
          <description>Interrupt status Register</description>
          <addressOffset>0x20</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Q0IS</name>
              <description>Queue interrupt status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLTxQOMR</name>
          <description>Tx queue operating mode Register</description>
          <addressOffset>0x100</addressOffset>
          <resetValue>0x00070008</resetValue>
          <fields>
            <field>
              <name>TQS</name>
              <description>Transmit Queue Size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>TTC</name>
              <description>Transmit Threshold Control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TXQEN</name>
              <description>Transmit Queue Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TSF</name>
              <description>Transmit Store and Forward</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTQ</name>
              <description>Flush Transmit Queue</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLTxQUR</name>
          <description>Tx queue underflow register</description>
          <addressOffset>0x104</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UFCNTOVF</name>
              <description>Overflow Bit for Underflow Packet Counter</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UFFRMCNT</name>
              <description>Underflow Packet Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLTxQDR</name>
          <description>Tx queue debug Register</description>
          <addressOffset>0x108</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STXSTSF</name>
              <description>Number of Status Words in Tx Status FIFO of Queue</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PTXQ</name>
              <description>Number of Packets in the Transmit Queue</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TXSTSFSTS</name>
              <description>MTL Tx Status FIFO Full Status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXQSTS</name>
              <description>MTL Tx Queue Not Empty Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWCSTS</name>
              <description>MTL Tx Queue Write Controller Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRCSTS</name>
              <description>MTL Tx Queue Read Controller Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TXQPAUSED</name>
              <description>Transmit Queue in Pause</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLQICSR</name>
          <description>Queue interrupt control status Register</description>
          <addressOffset>0x12C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RXOIE</name>
              <description>Receive Queue Overflow Interrupt Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVFIS</name>
              <description>Receive Queue Overflow Interrupt Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXUIE</name>
              <description>Transmit Queue Underflow Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXUNFIS</name>
              <description>Transmit Queue Underflow Interrupt Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLRxQOMR</name>
          <description>Rx queue operating mode register</description>
          <addressOffset>0x130</addressOffset>
          <resetValue>0x00700000</resetValue>
          <fields>
            <field>
              <name>RQS</name>
              <description>Receive Queue Size</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>RFD</name>
              <description>Threshold for Deactivating Flow Control</description>
              <bitOffset>14</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>RFA</name>
              <description>Threshold for Activating Flow Control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EHFC</name>
              <description>Enable Hardware Flow Control</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIS_TCP_EF</name>
              <description>Disable Dropping of TCP</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSF</name>
              <description>Receive Queue Store and Forward</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FEP</name>
              <description>Forward Error Packets</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FUP</name>
              <description>Forward Undersized Good Packets</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTC</name>
              <description>Receive Queue Threshold Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLRxQMPOCR</name>
          <description>Rx queue missed packet and overflow counter register</description>
          <addressOffset>0x134</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MISCNTOVF</name>
              <description>Missed Packet Counter Overflow Bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISPKTCNT</name>
              <description>Missed Packet Counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>OVFCNTOVF</name>
              <description>Overflow Counter Overflow Bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVFPKTCNT</name>
              <description>Overflow Packet Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTLRxQDR</name>
          <description>Rx queue debug register</description>
          <addressOffset>0x138</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRXQ</name>
              <description>Number of Packets in Receive Queue</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
            <field>
              <name>RXQSTS</name>
              <description>MTL Rx Queue Fill-Level Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RRCSTS</name>
              <description>MTL Rx Queue Read Controller State</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RWCSTS</name>
              <description>MTL Rx Queue Write Controller Active Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
