knieriem/tinygo-stm32-svd/svd/stm32h755cm4.svd
        <register>
          <name>BMTRGR</name>
          <displayName>BMTRG</displayName>
          <description>BMTRG</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OCHPEV</name>
              <description>OCHPEV</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>OCHPEV</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>Rising edge on an on-chip event has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Rising edge on an on-chip event triggers a burst mode entry</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TACMP1</name>
              <description>TACMP1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TACMP1</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>Timer X compare Y event has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Timer X compare Y event triggers a burst mode entry</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TECMP2</name>
              <description>TECMP2</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TACMP1"/>
            </field>
            <field>
              <name>TECMP1</name>
              <description>TECMP1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TACMP1"/>
            </field>
            <field>
              <name>TAREP</name>
              <description>TAREP</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TAREP</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>Timer X repetition event has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Timer X repetition event triggers a burst mode entry</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEREP</name>
              <description>TEREP</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TAREP"/>
            </field>
            <field>
              <name>TARST</name>
              <description>TARST</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TARST</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>Timer X reset/roll-over event has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Timer X reset/roll-over event triggers a burst mode entry</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TERST</name>
              <description>TERST</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TARST"/>
            </field>
            <field>
              <name>TDCMP2</name>
              <description>TDCMP2</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TACMP1"/>
            </field>
            <field>
              <name>TDCMP1</name>
              <description>TDCMP1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TACMP1"/>
            </field>
            <field>
              <name>TDREP</name>
              <description>TDREP</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TAREP"/>
            </field>
            <field>
              <name>TDRST</name>
              <description>TDRST</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TARST"/>
            </field>
            <field>
              <name>TCCMP2</name>
              <description>TCCMP2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TACMP1"/>
            </field>
            <field>
              <name>TCCMP1</name>
              <description>TCCMP1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TACMP1"/>
            </field>
            <field>
              <name>TCREP</name>
              <description>TCREP</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TAREP"/>
            </field>
            <field>
              <name>TCRST</name>
              <description>TCRST</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TARST"/>
            </field>
            <field>
              <name>TBCMP2</name>
              <description>TBCMP2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TACMP1"/>
            </field>
            <field>
              <name>TBCMP1</name>
              <description>TBCMP1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TACMP1"/>
            </field>
            <field>
              <name>TBREP</name>
              <description>TBREP</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TAREP"/>
            </field>
            <field>
              <name>TBRST</name>
              <description>TBRST</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TARST"/>
            </field>
            <field>
              <name>TACMP2</name>
              <description>TACMP2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TACMP1"/>
            </field>
            <field>
              <name>MSTCMP1</name>
              <description>MSTCMP1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MSTCMP1</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>Master timer compare X event has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Master timer compare X event triggers a burst mode entry</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSTCMP4</name>
              <description>MSTCMP4</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MSTCMP1"/>
            </field>
            <field>
              <name>MSTCMP3</name>
              <description>MSTCMP3</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MSTCMP1"/>
            </field>
            <field>
              <name>MSTCMP2</name>
              <description>MSTCMP2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="MSTCMP1"/>
            </field>
            <field>
              <name>MSTREP</name>
              <description>MSTREP</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MSTREP</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>Master timer repetition event has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Master timer repetition event triggers a burst mode entry</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSTRST</name>
              <description>MSTRST</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MSTRST</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>Master timer reset/roll-over event has no effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Master timer reset/roll-over event triggers a burst mode entry</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW</name>
              <description>SW</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SW</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger immediate burst mode operation</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAEEV7</name>
              <description>Timer A period following External Event 7</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TDEEV8</name>
              <description>Timer D period following External Event 8</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EEV7</name>
              <description>External Event 7 (TIMA filters applied)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EEV8</name>
              <description>External Event 8 (TIMD filters applied)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BMCMPR</name>
          <displayName>BMCMPR6</displayName>
          <description>BMCMPR6</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BMCMP</name>
              <description>BMCMP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>BMPER</name>
          <displayName>BMPER</displayName>
          <description>Burst Mode Period Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BMPER</name>
              <description>Burst mode Period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EECR1</name>
          <displayName>EECR1</displayName>
          <description>Timer External Event Control Register
          1</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>1-5</dimIndex>
              <name>EE%sFAST</name>
              <description>External Event %s Fast mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EE1FAST</name>
                <enumeratedValue>
                  <name>Resynchronized</name>
                  <description>External event is re-synchronised by the HRTIM logic before acting on outputs</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Asynchronous</name>
                  <description>External event is acting asynchronously on outputs (low-latency mode)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>1-5</dimIndex>
              <name>EE%sSNS</name>
              <description>External Event %s
              Sensitivity</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>EE1SNS</name>
                <enumeratedValue>
                  <name>Active</name>
                  <description>On active level defined by EExPOL bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Rising</name>
                  <description>Rising edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Falling</name>
                  <description>Falling edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Both</name>
                  <description>Both edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>1-5</dimIndex>
              <name>EE%sPOL</name>
              <description>External Event %s Polarity</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EE1POL</name>
                <enumeratedValue>
                  <name>ActiveHigh</name>
                  <description>External event is active high</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ActiveLow</name>
                  <description>External event is active low</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>1-5</dimIndex>
              <name>EE%sSRC</name>
              <description>External Event %s Source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>EE1SRC</name>
                <enumeratedValue>
                  <name>Src1</name>
                  <description>Source 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src2</name>
                  <description>Source 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src3</name>
                  <description>Source 3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src4</name>
                  <description>Source 4</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EECR2</name>
          <displayName>EECR2</displayName>
          <description>Timer External Event Control Register
          2</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>6-10</dimIndex>
              <name>EE%sSNS</name>
              <description>External Event %s
              Sensitivity</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>EE6SNS</name>
                <enumeratedValue>
                  <name>Active</name>
                  <description>On active level defined by EExPOL bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Rising</name>
                  <description>Rising edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Falling</name>
                  <description>Falling edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Both</name>
                  <description>Both edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>6-10</dimIndex>
              <name>EE%sPOL</name>
              <description>External Event %s Polarity</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EE6POL</name>
                <enumeratedValue>
                  <name>ActiveHigh</name>
                  <description>External event is active high</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ActiveLow</name>
                  <description>External event is active low</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>6-10</dimIndex>
              <name>EE%sSRC</name>
              <description>External Event %s Source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>EE6SRC</name>
                <enumeratedValue>
                  <name>Src1</name>
                  <description>Source 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src2</name>
                  <description>Source 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src3</name>
                  <description>Source 3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Src4</name>
                  <description>Source 4</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
